Revit 2027 API
CompoundStructureLayer(CompoundStructureLayer) Constructor
 Creates a copy of a compound structure layer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CompoundStructureLayer(
	CompoundStructureLayer cs
)
Public Sub New (
	cs As CompoundStructureLayer
)
public:
CompoundStructureLayer(
	CompoundStructureLayer^ cs
)
new :
        cs : CompoundStructureLayer -> CompoundStructureLayer
Parameters
cs CompoundStructureLayer
 The compound structure to copy.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CompoundStructureLayer Class
CompoundStructureLayer Overload
Autodesk.Revit.DB Namespace